<template>
    <div id="page">
        <h1 id="textH1" class="text">Папка Артём<br>
успешный программист, спортсмен,<br>
филантроп, да и вообщем хороший человек</h1>
<img id="img1" src="../assets/img4.png" alt="">
<p class="text">
Артём Папка – имя, которое гремит в мире IT,<br>
словно раскат грома! ⚡️ Этот парень не<br>
просто программист, а настоящий волшебник<br> 
кода, чьи творения захватывают миллионы. 💻<br>
Его называют гением современности, кудесником<br>
цифр и королём алгоритмов. 👑
</p>
<br>
<hr>
<br>
<img id="img2" src="../assets/img2.png" alt="">
<p class="text">
Артём — не просто популярен,<br>
он — настоящая звезда! ✨<br> 
Каждое его выступление на конференциях<br> 
собирает полные залы, а онлайн-курсы<br>
разлетаются как горячие пирожки 🔥<br> 
Его знают все: от начинающих кодеров до<br>
маститых IT-гуру. Артём умеет говорить о сложном<br>
просто и увлекательно, заражая всех своей<br>
страстью к программированию.
</p>
<br>
<hr>
<br>
<img id="img3" src="../assets/img3.png" alt="">
<p class="text">
И да, он зарабатывает неприлично много! 💰 <br>
Но деньги для Артёма – не самоцель, <br>
а лишь приятный бонус за любимое дело. <br>
Он вкладывает их в новые проекты, помогает <br>
молодым талантам и поддерживает образовательные <br>
инициативы. 🚀
</p>
<br>
<hr>
<br>
</div>
</template>

<script setup>

</script>

<style scoped>
img{
    float: left;
    margin-right: 10px;
}
hr{
border: 1px solid #A8A8A8;
}
.text{
font-family: 'Gill Sans', 'Gill Sans MT', Calibri, 'Trebuchet MS', sans-serif;
color: #000000;
width: 100%;
position: static;
margin: 0;
font-weight: 700;
font-size: 2vw;
}
#page{
top: 3vw;
position: relative;
} 
#textH1{
margin-left: auto;
margin-right: auto;
text-align: center;
margin-bottom: 4vw;
}
#img1{
   height: 16vw; 
}
#img2{
   height: 22vw; 
}
#img3{
   height: 16vw; 
}
</style>
